DataProcessors/РаботаСПоиском.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>РаботаСПоиском</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПоискПоНаименованию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоискПоКоду</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочноеСоответствие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПоиска</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдИзм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/РаботаСПоиском/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура НайтиПоКодуНаСервере()
	ДлинаПередаваемойСтроки = СтрДлина(Объект.ПоискПоКоду);
	ДлинаКодаСправочника = Метаданные.Справочники.Номенклатура.ДлинаКода;
	КоличествоЛидирующихНулей = ДлинаКодаСправочника - ДлинаПередаваемойСтроки;
	
	ЛидирующиеНули = "";
	
	Для ПолучЗн = 1 По КоличествоЛидирующихНулей Цикл
		ЛидирующиеНули = ЛидирующиеНули + "0";
	КонецЦикла;
	
	Объект.ПоискПоКоду = ЛидирующиеНули + Объект.ПоискПоКоду;
	
	Спр = Справочники.Номенклатура;
	
	НайденнаяСсылка = Спр.НайтиПоКоду(Объект.ПоискПоКоду);
	
	Если НайденнаяСсылка = Спр.ПустаяСсылка() Тогда
		Сообщить("Элемента с кодом: " + Объект.ПоискПоКоду + " еще нет в базе.");
	Иначе
		Если НайденнаяСсылка.ЭтоГруппа Тогда
			Сообщить("Найденная ссылка является группой!");
			Возврат;
		КонецЕсли;
		
		Сообщить("Найден элемент с кодом: " + Объект.ПоискПоКоду + 
		" - его наименование: " + НайденнаяСсылка.Наименование);
		
		Объект.РезультатПоиска = НайденнаяСсылка.Ссылка;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоКоду(Команда)
	ОчиститьСообщения();
	Объект.РезультатПоиска = "";
	НайтиПоКодуНаСервере();
КонецПроцедуры

&НаСервере
Процедура НайтиПоНаименованиюНаСервере()
	
	Спр = Справочники.Номенклатура;
	НайденнаяСсылка = Спр.НайтиПоНаименованию(Объект.ПоискПоНаименованию, Объект.ТочноеСоответствие);
	
	Если НайденнаяСсылка = Спр.ПустаяСсылка() Тогда
		Сообщить("Элемента с наименованием: " + Объект.ПоискПоНаименованию + " - еще нет в базе!");
		
		Если Объект.ТочноеСоответствие Тогда
			Сообщить("-----------------------");
			
			НовЭл = Спр.СоздатьЭлемент();
			НовЭл.Наименование = Объект.ПоискПоНаименованию;
			НовЭл.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар;
			
			
			СпрЕдИзм = Справочники.ЕдиницыИзмерения;
			НайденнаяЕИ = СпрЕдИзм.НайтиПоНаименованию("Шт",Истина);
			
			НовЭл.ЕдИзм = НайденнаяЕИ;
			
			НовЭл.Записать();
			
			Сообщить("Создан новый элемент: " + НовЭл.Наименование);
			
			Объект.РезультатПоиска = НовЭл.Ссылка;
			
		КонецЕсли;
	Иначе
		Если НайденнаяСсылка.ЭтоГруппа Тогда
			Сообщить("Найденная ссылка является группой");
			Возврат;
		КонецЕсли;
		
		Сообщить("Найденный элемент с наименованием: " + НайденнаяСсылка.Наименование +
		" - имеет значение кода: "  + НайденнаяСсылка.Код);
		
		Объект.РезультатПоиска = НайденнаяСсылка.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоНаименованию(Команда)
	ОчиститьСообщения();
	Объект.РезультатПоиска = "";
	НайтиПоНаименованиюНаСервере();
КонецПроцедуры
